class t:
    # --- МЕНЮ ---
    menu_title = "📋 <b>Меню</b>\n\nВыбери действие:"

    # --- УПРАВЛЕНИЕ СЕРВЕРОМ ---
    server_starting = "🚀 Запускаем сервер... Пожалуйста, подождите."
    server_started = "✅ Сервер успешно запущен!"
    server_stopping = "🛑 Останавливаем сервер... Это может занять некоторое время."
    server_stopped = "✅ Сервер успешно остановлен."
    server_restarting = "🔄 Перезапускаем сервер... Пожалуйста, подождите."
    server_restarted = "✅ Сервер успешно перезапущен!"
    # server_status_online = "🟢 <b>Сервер онлайн</b>"
    # server_status_offline = "🔴 <b>Сервер оффлайн</b>"
    status_offline = "🔴 <b>Сервер выключен</b>"
    status_starting = "🟡 <b>Сервер запускается...</b>\n<i>Процесс запущен, ожидаем загрузку ядра и миров.</i>"
    status_online = (
        "🟢 <b>Сервер работает!</b>\n\n"
        "👥 Игроков: <b>{online}/{max}</b>\n"
        "📶 Пинг: <b>{ping} ms</b>"
    )

    # --- УПРАВЛЕНИЕ МИРАМИ: ПРОМПТЫ (Ожидание действий) ---
    no_worlds_found = "😔 Миры не найдены. Сначала создайте новый мир."
    world_card = "🌐 <b>{world}</b>\n• Активен: {status}"
    world_creation_prompt = (
        "📝 Введите название нового мира\n\n"
        "<i>Правила:\n"
        "• От 1 до 40 символов\n"
        "• Только английские буквы, цифры и знак подчеркивания _</i>"
    )
    world_invalid_name = (
        "❌ <b>Недопустимое название!</b>\n"
        "Название должно быть не длиннее 40 символов и содержать только [A-Z, a-z, 0-9, _].\n\n"
        "Попробуйте еще раз:"
    )
    world_same_name = "🤔 Новое имя совпадает со старым!\nВведите другое имя:"
    world_renaming_prompt = (
        "📝 Введите новое имя для мира {world_name}\n\n"
        "<i>Правила:\n"
        "• От 1 до 40 символов\n"
        "• Только английские буквы, цифры и знак подчеркивания _</i>"
    )

    # --- УПРАВЛЕНИЕ МИРАМИ: В ПРОЦЕССЕ (Заглушки на время загрузки) ---
    world_changing_process = (
        "🔄 Переключаю активный мир на <b>{world_name}</b> и запускаю сервер..."
    )
    world_renaming_process = "📝 Меняю название мира с {old_name} на {new_name}..."
    world_archiving_process = "💾 Архивирую мир <b>{world_name}</b>..."
    world_creating_process = "✨ Создаю мир <b>{world_name}</b>... Сервер запускается для генерации ландшафта, подождите."
    world_deleting_process = "🗑 Удаляю файлы мира <b>{world_name}</b>..."

    # --- УПРАВЛЕНИЕ МИРАМИ: УСПЕХ ---
    world_change_success = (
        "✅ Сервер успешно переведен на мир <b>{world_name}</b> и запущен!"
    )
    world_renaming_success = "✅ Мир был успешно переименован!{}"
    world_archive_sucess = "✅ Мир <b>{world_name}</b> был успешно заархивирован!\nАрхив выслан в чат с ботом 🤖"
    world_create_success = "✅ Мир <b>{world_name}</b> успешно сгенерирован и запущен!"
    world_delete_success = "✅ Мир <b>{world_name}</b> был безвозвратно удален с диска"

    # --- ПОДТВЕРЖДЕНИЕ ДЕЙСТВИЙ ---
    world_delete_confirm = (
        "🗑 <b>Подтверждение удаления</b>\n\n"
        "Вы действительно хотите <b>БЕЗВОЗВРАТНО</b> удалить мир <code>{world_name}</code>?\n\n"
        "<i>⚠️ Все постройки, инвентари и прогресс будут навсегда уничтожены!</i>"
    )

    world_switch_confirm = (
        "🔄 <b>Подтверждение смены мира</b>\n\n"
        "Сделать активным мир <code>{world_name}</code>?\n\n"
        "<i>⚠️ Текущий сервер будет остановлен, все игроки будут отключены, после чего сервер запустится с выбранным миром.</i>"
    )

    world_archive_confirm = (
        "💾 <b>Подтверждение архивации мира</b>\n\n"
        "Вы действительно хотите создать резервную копия вашего мира <code>{world_name}</code>?\n\n"
        "<i>⚠️ Вы получите <b>.zip</b> архив папки с вашим миром</i>!"
    )

    # --- СОЗДАНИЕ МИРА: ОТМЕНА ---
    action_canceled = "🚫 <b>Действие отменено.</b>"
    nothing_to_cancel = "Сейчас нет активного действия. Открой /menu."

    # --- ОБЩИЕ СООБЩЕНИЯ И ОШИБКИ ---
    error_message = "❌ <b>Произошла ошибка</b>:\n<code>{error}</code>"
    unknown_command = "🤔 Неизвестная команда. Используйте /help для списка команд."
    permission_denied = "🚫 <b>У вас нет прав</b> для выполнения этой команды."
